# 2.38

```scheme
(define (fold-left op initial sequence)
    (define (iter result rest)
        (if (null? rest)
            result
            (iter (op result (car rest))
                  (cdr rest))))
    (iter initial sequence))
```

```bash
gosh> (fold-right / 1 (list 1 2 3))
3/2
gosh> (fold-left / 1 (list 1 2 3))
1/6
gosh> (fold-right list () (list 1 2 3))
(1 (2 (3 ())))
gosh> (fold-left list () (list 1 2 3))
(((() 1) 2) 3)
```

+じゃだめなの？
